system/dpd/src/lib/API/Client/logs/b5b8afa8f0ea2a511214f3300e187c79.logs

LOCATION: 
http://wstest.dpd.ru:80/services/geography2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/geography/2015-05-20"><SOAP-ENV:Body><ns1:getParcelShops><request><auth><clientNumber>1001027795</clientNumber><clientKey>182A17BD6FC5557D1FCA30FA1D56593EB21AEF88</clientKey></auth><countryCode>KG</countryCode></request></ns1:getParcelShops></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getParcelShopsResponse xmlns:ns2="http://dpd.ru/ws/geography/2015-05-20"><return><parcelShop><code>001W</code><parcelShopType>ПВП</parcelShopType><state>Open</state><address><cityId>6027190034</cityId><countryCode>KG</countryCode><regionCode>01</regionCode><regionName>Чуйская</regionName><cityCode>01000000001</cityCode><cityName>Бишкек</cityName><index>720001</index><street>Медерова</street><streetAbbr>ул</streetAbbr><houseNo>69</houseNo><descript>ИП Ли Евгения Владимировна</descript></address><brand>Кимчи 1</brand><clientDepartmentNum>Кимчи 1</clientDepartmentNum><geoCoordinates><latitude>42.875989</latitude><longitude>74.603674</longitude></geoCoordinates><limits><maxShipmentWeight>30</maxShipmentWeight><maxWeight>30</maxWeight><maxLength>180</maxLength><maxWidth>100</maxWidth><maxHeight>100</maxHeight><dimensionSum>280</dimensionSum></limits><schedule><operation>Payment</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>10:00 - 20:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfDelivery</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>10:00 - 20:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><extraService><esCode>НПП</esCode><params><name>sum_npp</name><value>100000</value></params></extraService><extraService><esCode>ТРМ</esCode></extraService><services><serviceCode>CUR</serviceCode><serviceCode>ECU</serviceCode><serviceCode>PCL</serviceCode><serviceCode>CSM</serviceCode></services></parcelShop><parcelShop><code>002W</code><parcelShopType>ПВП</parcelShopType><state>Open</state><address><cityId>6027190034</cityId><countryCode>KG</countryCode><regionCode>01</regionCode><regionName>Чуйская</regionName><cityCode>01000000001</cityCode><cityName>Бишкек</cityName><index>720001</index><street>Сухэ-Батора</street><streetAbbr>ул</streetAbbr><houseNo>5/1</houseNo><descript>ИП Ким Жанна Яромировна</descript></address><brand>Кимчи 3</brand><clientDepartmentNum>Кимчи 3</clientDepartmentNum><geoCoordinates><latitude>42.875989</latitude><longitude>74.603674</longitude></geoCoordinates><limits><maxShipmentWeight>15</maxShipmentWeight><maxWeight>30</maxWeight><maxLength>180</maxLength><maxWidth>50</maxWidth><maxHeight>50</maxHeight><dimensionSum>280</dimensionSum></limits><schedule><operation>Payment</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт,Сб,Вс</weekDays><workTime>10:00 - 20:00</workTime></timetable></schedule><schedule><operation>SelfDelivery</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт,Сб,Вс</weekDays><workTime>10:00 - 20:00</workTime></timetable></schedule><extraService><esCode>НПП</esCode><params><name>sum_npp</name><value>100000</value></params></extraService><extraService><esCode>ТРМ</esCode></extraService><services><serviceCode>CUR</serviceCode><serviceCode>ECU</serviceCode><serviceCode>PCL</serviceCode><serviceCode>CSM</serviceCode></services></parcelShop><parcelShop><code>01D</code><parcelShopType>ПВП</parcelShopType><state>Open</state><address><cityId>6027190034</cityId><countryCode>KG</countryCode><regionCode>01</regionCode><regionName>Чуйская</regionName><cityCode>01000000001</cityCode><cityName>Бишкек</cityName><index>720001</index><street>Медерова</street><streetAbbr>ул</streetAbbr><houseNo>69</houseNo><descript>Общество с ограниченной ответственностью "KobEx"</descript></address><brand>DPD</brand><geoCoordinates><latitude>42.875989</latitude><longitude>74.603674</longitude></geoCoordinates><schedule><operation>Payment</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfDelivery</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfPickup</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><extraService><esCode>НПП</esCode><params><name>sum_npp</name><value>150000</value></params></extraService><services><serviceCode>NDY</serviceCode><serviceCode>BZP</serviceCode><serviceCode>CUR</serviceCode><serviceCode>ECU</serviceCode><serviceCode>IND</serviceCode><serviceCode>PCL</serviceCode></services></parcelShop><parcelShop><code>05D</code><parcelShopType>ПВП</parcelShopType><state>Open</state><address><cityId>6027190034</cityId><countryCode>KG</countryCode><regionCode>01</regionCode><regionName>Чуйская</regionName><cityCode>01000000001</cityCode><cityName>Бишкек</cityName><index>720001</index><street>Табышалиева</street><streetAbbr>ул</streetAbbr><houseNo>11</houseNo><descript>Общество с ограниченной ответственностью "KobEx"</descript></address><brand>DPD</brand><geoCoordinates><latitude>42.868318</latitude><longitude>74.585726</longitude></geoCoordinates><limits><maxWeight>30</maxWeight><maxLength>50</maxLength><maxWidth>50</maxWidth><maxHeight>50</maxHeight></limits><schedule><operation>Payment</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт,Сб,Вс</weekDays><workTime>круглосуточно</workTime></timetable></schedule><schedule><operation>SelfDelivery</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfPickup</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><extraService><esCode>НПП</esCode><params><name>sum_npp</name><value>200000</value></params></extraService><services><serviceCode>CUR</serviceCode><serviceCode>ECU</serviceCode><serviceCode>PCL</serviceCode><serviceCode>CSM</serviceCode></services></parcelShop><parcelShop><code>06D</code><parcelShopType>ПВП</parcelShopType><state>Open</state><address><cityId>6027190034</cityId><countryCode>KG</countryCode><regionCode>01</regionCode><regionName>Чуйская</regionName><cityCode>01000000001</cityCode><cityName>Бишкек</cityName><index>720001</index><street>Огонбаева Атая</street><streetAbbr>ул</streetAbbr><houseNo>222</houseNo><descript>Общество с ограниченной ответственностью "KobEx"</descript></address><brand>DPD</brand><geoCoordinates><latitude>42.877509</latitude><longitude>74.61882</longitude></geoCoordinates><limits><maxWeight>80</maxWeight><maxLength>50</maxLength><maxWidth>50</maxWidth><maxHeight>50</maxHeight><dimensionSum>150</dimensionSum></limits><schedule><operation>Payment</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfDelivery</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfPickup</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><extraService><esCode>НПП</esCode><params><name>sum_npp</name><value>200000</value></params></extraService><services><serviceCode>CUR</serviceCode><serviceCode>ECU</serviceCode><serviceCode>PCL</serviceCode><serviceCode>CSM</serviceCode></services></parcelShop><parcelShop><code>FRU</code><parcelShopType>ПВП</parcelShopType><state>Open</state><address><cityId>9728754354</cityId><countryCode>KG</countryCode><regionCode>01</regionCode><regionName>Чуйская</regionName><cityCode>01005000016</cityCode><cityName>Пригородное</cityName><index>724327</index><street>Сибирская</street><descript>СКЛАД ЗЕРНОХРАНИЛИЩЕ      Общество с ограниченной ответственностью "KobEx"
ИНН:01108201510038 Код ОКПО:29245946</descript></address><brand>DPD</brand><geoCoordinates><latitude>42.907206</latitude><longitude>74.556372</longitude></geoCoordinates><schedule><operation>Payment</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfDelivery</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><schedule><operation>SelfPickup</operation><timetable><weekDays>Пн,Вт,Ср,Чт,Пт</weekDays><workTime>09:00 - 18:00</workTime></timetable><timetable><weekDays>Сб,Вс</weekDays><workTime>выходной</workTime></timetable></schedule><extraService><esCode>НПП</esCode><params><name>sum_npp</name><value>200000</value></params></extraService><services><serviceCode>NDY</serviceCode><serviceCode>BZP</serviceCode><serviceCode>CUR</serviceCode><serviceCode>ECU</serviceCode><serviceCode>IND</serviceCode><serviceCode>MAX</serviceCode><serviceCode>PCL</serviceCode><serviceCode>CSM</serviceCode></services></parcelShop></return></ns2:getParcelShopsResponse></S:Body></S:Envelope>
